import os
from scipy import spatial
import tiktoken
import pandas as pd
from rag_utils import ask
from utils import get_embedding


df = pd.read_pickle('final.pkl')

print(ask('دوره جدید بینایی کامپیوتر چه زمانی اماده میشه', df))

# outputs: 
# 1. **پاسخ نهایی:** دوره جدید بینایی کامپیوتر هنوز آماده نشده است و استاد در حال کار بر روی دوره پردازش تصویر هستند.

# 2. **چرا این پاسخ را انتخاب کردم:** من این پاسخ را بر اساس گفتگویی که در مورد آماده شدن دوره جدید بینایی کامپیوتر و اظهار نظر استاد درباره درگیر بودن با دوره پردازش تصویر انتخاب کردم. در این گفتگو، هیچ تاریخ مشخصی برای آماده شدن دوره جدید ذکر نشده است و فقط امیدواری به شروع آن وجود دارد.

# 3. **گفتگوی مرتبط:**
#    ```
#    -> سلام استاد دوره جدید بینایی کامپیوتر کی آماده میشه ما منتظر هستیم
#    -> سلام درگیر دوره پردازش تصویر هستیم امیدوارم از نهر بتونیم شروع کنیم
